---
kind: type
id: T:Autodesk.Revit.DB.IFC.IFCExtrusionCalculatorUtils
source: html/926b73c9-932f-d429-e316-a905a9434fca.htm
---
# Autodesk.Revit.DB.IFC.IFCExtrusionCalculatorUtils

A utility class used to calculate extrusion data from Revit geometry for IFC export.

## Syntax (C#)
```csharp
public static class IFCExtrusionCalculatorUtils
```